module {
  func.func @main_graph(%arg0: !torch.vtensor<[16,1024],f32>) -> !torch.vtensor<[16,10],f32> attributes {torch.onnx_meta.ir_version = 10 : si64, torch.onnx_meta.opset_version = 20 : si64, torch.onnx_meta.producer_name = "onnx.quantize", torch.onnx_meta.producer_version = "0.1.0"} {
    %0 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %1 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.0424246378> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %2 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %3 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.0168602373> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %4 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %5 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<2.46058975E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %6 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_fc.weight_quantized> : tensor<128x1024xsi8>} : () -> !torch.vtensor<[128,1024],si8> 
    %7 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %8 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.0168602373> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %9 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %10 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.00748311541> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %11 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %12 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<6.95691211E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %13 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_fc2.weight_quantized> : tensor<10x128xsi8>} : () -> !torch.vtensor<[10,128],si8> 
    %14 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8> 
    %15 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.00787401571> : tensor<f32>} : () -> !torch.vtensor<[],f32> 
    %16 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_fc.bias_quantized> : tensor<128xsi32>} : () -> !torch.vtensor<[128],si32> 
    %17 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_fc.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32> 
    %18 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32> 
    %19 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_fc2.bias_quantized> : tensor<10xsi32>} : () -> !torch.vtensor<[10],si32> 
    %20 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_fc2.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32> 
    %21 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32> 
    %none = torch.constant.none
    %22 = torch.operator "onnx.DequantizeLinear"(%16, %17, %18) : (!torch.vtensor<[128],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[128],f32> 
    %23 = torch.operator "onnx.DequantizeLinear"(%6, %5, %4) : (!torch.vtensor<[128,1024],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,1024],f32> 
    %24 = torch.operator "onnx.DequantizeLinear"(%19, %20, %21) : (!torch.vtensor<[10],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[10],f32> 
    %25 = torch.operator "onnx.DequantizeLinear"(%13, %12, %11) : (!torch.vtensor<[10,128],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[10,128],f32> 
    %26 = torch.operator "onnx.QuantizeLinear"(%arg0, %1, %0) : (!torch.vtensor<[16,1024],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,1024],si8> 
    %27 = torch.operator "onnx.DequantizeLinear"(%26, %1, %0) : (!torch.vtensor<[16,1024],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,1024],f32> 
    %28 = torch.operator "onnx.Gemm"(%27, %23, %22) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[16,1024],f32>, !torch.vtensor<[128,1024],f32>, !torch.vtensor<[128],f32>) -> !torch.vtensor<[16,128],f32> 
    %29 = torch.operator "onnx.QuantizeLinear"(%28, %3, %2) : (!torch.vtensor<[16,128],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,128],si8> 
    %30 = torch.operator "onnx.DequantizeLinear"(%29, %3, %2) : (!torch.vtensor<[16,128],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,128],f32> 
    %31 = torch.operator "onnx.Relu"(%30) : (!torch.vtensor<[16,128],f32>) -> !torch.vtensor<[16,128],f32> 
    %32 = torch.operator "onnx.QuantizeLinear"(%31, %8, %7) : (!torch.vtensor<[16,128],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,128],si8> 
    %33 = torch.operator "onnx.DequantizeLinear"(%32, %8, %7) : (!torch.vtensor<[16,128],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,128],f32> 
    %34 = torch.operator "onnx.Gemm"(%33, %25, %24) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[16,128],f32>, !torch.vtensor<[10,128],f32>, !torch.vtensor<[10],f32>) -> !torch.vtensor<[16,10],f32> 
    %35 = torch.operator "onnx.QuantizeLinear"(%34, %10, %9) : (!torch.vtensor<[16,10],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,10],si8> 
    %36 = torch.operator "onnx.DequantizeLinear"(%35, %10, %9) : (!torch.vtensor<[16,10],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,10],f32> 
    %37 = torch.operator "onnx.Softmax"(%36) {torch.onnx.axis = 1 : si64} : (!torch.vtensor<[16,10],f32>) -> !torch.vtensor<[16,10],f32> 
    %38 = torch.operator "onnx.QuantizeLinear"(%37, %15, %14) : (!torch.vtensor<[16,10],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,10],si8> 
    %39 = torch.operator "onnx.DequantizeLinear"(%38, %15, %14) : (!torch.vtensor<[16,10],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[16,10],f32> 
    return %39 : !torch.vtensor<[16,10],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      _fc.weight_quantized: 